#+PROPERTY: header-args:python :session *python* :results value

#+begin_src python
f = open("rosalind_hamm.txt", "r")
line_one = f.readline()
line_two = f.readline()

dist = 0

for char in range(len(line_one)):
    if (line_one[char] != line_two[char]):
        dist = dist + 1

dist
#+end_src

#+RESULTS:
: 468
